# Window Functions in SQL

## Introduction

Window functions in SQL are advanced analytical functions that perform calculations across a set of rows related to the current row.

Unlike `GROUP BY`, window functions do not collapse rows. Instead, they return aggregated or ranked results while preserving individual row-level detail.

They are commonly used for ranking, running totals, moving averages, and time-based analysis.

Window functions are widely used in data analytics, reporting, and performance analysis where row-wise comparison within partitions is required.

---

## Key Concepts

- `OVER()` clause  
- `PARTITION BY`  
- `ORDER BY` (within window)  
- Ranking functions (`ROW_NUMBER`, `RANK`, `DENSE_RANK`)  
- Offset functions (`LAG`, `LEAD`)  
- Running totals and cumulative calculations

## Basic Syntax
FUNCTION() OVER (  
    PARTITION BY column  
    ORDER BY column  
)  

- PARTITION BY → Grouping (like mini GROUP BY)
- ORDER BY → Defines order inside partition

### Database Connection

In [1]:
%reload_ext sql
%config SqlMagic.style = '_DEPRECATED_DEFAULT'
%sql mysql+pymysql://root:Bhavesh%402025@localhost/customers

### ROW_NUMBER()

### Example 1: Rank employees by salary

In [8]:
%%sql
SELECT name,salary,
ROW_NUMBER() OVER(ORDER BY salary DESC) AS row_num
FROM employees

 * mysql+pymysql://root:***@localhost/customers
8 rows affected.

[('Rahul', 85000, 1),
 ('Suresh', 75000, 2),
 ('Vikram', 65000, 3),
 ('Amit', 60000, 4),
 ('Anita', 55000, 5),
 ('Priya', 50000, 6),
 ('Rohit', 48000, 7),
 ('Neha', 45000, 8)]

### Example 2: Rank employees within each department

In [13]:
%%sql
SELECT name,salary,department,
ROW_NUMBER() OVER(PARTITION BY department
                 ORDER BY salary DESC) AS dept_rank
FROM employees;

 * mysql+pymysql://root:***@localhost/customers
8 rows affected.

[('Vikram', 65000, 'Finance', 1),
 ('Priya', 50000, 'Finance', 2),
 ('Neha', 45000, 'HR', 1),
 ('Rahul', 85000, 'IT', 1),
 ('Suresh', 75000, 'IT', 2),
 ('Amit', 60000, 'IT', 3),
 ('Anita', 55000, 'Marketing', 1),
 ('Rohit', 48000, 'Sales', 1)]

### Example 3: Top 1 per department

In [17]:
%%sql
WITH rank_data AS(
    SELECT name ,salary ,department,
    ROW_NUMBER() OVER(PARTITION BY department
                 ORDER BY salary DESC) AS dept_rank
FROM employees
)
SELECT * FROM rank_data
WHERE dept_rank=1

 * mysql+pymysql://root:***@localhost/customers
5 rows affected.

[('Vikram', 65000, 'Finance', 1),
 ('Neha', 45000, 'HR', 1),
 ('Rahul', 85000, 'IT', 1),
 ('Anita', 55000, 'Marketing', 1),
 ('Rohit', 48000, 'Sales', 1)]

### RANK() vs DENSE_RANK()

### Example 1: RANK()

In [18]:
%%sql
SELECT name,
       salary,
       RANK() OVER (ORDER BY salary DESC) AS salary_rank
FROM employees;

 * mysql+pymysql://root:***@localhost/customers
8 rows affected.

[('Rahul', 85000, 1),
 ('Suresh', 75000, 2),
 ('Vikram', 65000, 3),
 ('Amit', 60000, 4),
 ('Anita', 55000, 5),
 ('Priya', 50000, 6),
 ('Rohit', 48000, 7),
 ('Neha', 45000, 8)]

### Example 2: DENSE_RANK()

In [20]:
%%sql
SELECT name, salary,
DENSE_RANK()over(ORDER BY salary DESC)as salary_rank
FROM employees;

 * mysql+pymysql://root:***@localhost/customers
8 rows affected.

[('Rahul', 85000, 1),
 ('Suresh', 75000, 2),
 ('Vikram', 65000, 3),
 ('Amit', 60000, 4),
 ('Anita', 55000, 5),
 ('Priya', 50000, 6),
 ('Rohit', 48000, 7),
 ('Neha', 45000, 8)]

### Example 3: Rank employees per department

In [23]:
%%sql
SELECT name, salary,department,
DENSE_RANK()over(PARTITION BY department
                 ORDER BY salary DESC)as salary_rank
FROM employees;

 * mysql+pymysql://root:***@localhost/customers
8 rows affected.

[('Vikram', 65000, 'Finance', 1),
 ('Priya', 50000, 'Finance', 2),
 ('Neha', 45000, 'HR', 1),
 ('Rahul', 85000, 'IT', 1),
 ('Suresh', 75000, 'IT', 2),
 ('Amit', 60000, 'IT', 3),
 ('Anita', 55000, 'Marketing', 1),
 ('Rohit', 48000, 'Sales', 1)]

### NTILE()
Divides rows into equal groups.

### Example 1: Divide employees into 3 salary groups

In [27]:
%%sql
SELECT name,salary,
NTILE(3)OVER(ORDER BY salary DESC) AS salary_group
FROM employees;

 * mysql+pymysql://root:***@localhost/customers
8 rows affected.

[('Rahul', 85000, 1),
 ('Suresh', 75000, 1),
 ('Vikram', 65000, 1),
 ('Amit', 60000, 2),
 ('Anita', 55000, 2),
 ('Priya', 50000, 2),
 ('Rohit', 48000, 3),
 ('Neha', 45000, 3)]

### Aggregate Window Functions

### Example 1: Department average salary (without GROUP BY)

In [32]:
%%sql
select name,salary,department,
AVG(salary)OVER(PARTITION BY department) AS dept_avg
FROM employees

 * mysql+pymysql://root:***@localhost/customers
8 rows affected.

[('Priya', 50000, 'Finance', Decimal('57500.0000')),
 ('Vikram', 65000, 'Finance', Decimal('57500.0000')),
 ('Neha', 45000, 'HR', Decimal('45000.0000')),
 ('Amit', 60000, 'IT', Decimal('73333.3333')),
 ('Rahul', 85000, 'IT', Decimal('73333.3333')),
 ('Suresh', 75000, 'IT', Decimal('73333.3333')),
 ('Anita', 55000, 'Marketing', Decimal('55000.0000')),
 ('Rohit', 48000, 'Sales', Decimal('48000.0000'))]

### Example 2: Company-wide average salary

In [34]:
%%sql
SELECT name,salary,
AVG(salary)over()AS avg_salary
FROM employees

 * mysql+pymysql://root:***@localhost/customers
8 rows affected.

[('Amit', 60000, Decimal('60375.0000')),
 ('Neha', 45000, Decimal('60375.0000')),
 ('Rahul', 85000, Decimal('60375.0000')),
 ('Priya', 50000, Decimal('60375.0000')),
 ('Suresh', 75000, Decimal('60375.0000')),
 ('Anita', 55000, Decimal('60375.0000')),
 ('Vikram', 65000, Decimal('60375.0000')),
 ('Rohit', 48000, Decimal('60375.0000'))]

### Example 3: Total salary per department

In [35]:
%%sql
SELECT name,salary,department,
SUM(salary) OVER(PARTITION BY department)as dept_total_salary
from employees

 * mysql+pymysql://root:***@localhost/customers
8 rows affected.

[('Priya', 50000, 'Finance', Decimal('115000')),
 ('Vikram', 65000, 'Finance', Decimal('115000')),
 ('Neha', 45000, 'HR', Decimal('45000')),
 ('Amit', 60000, 'IT', Decimal('220000')),
 ('Rahul', 85000, 'IT', Decimal('220000')),
 ('Suresh', 75000, 'IT', Decimal('220000')),
 ('Anita', 55000, 'Marketing', Decimal('55000')),
 ('Rohit', 48000, 'Sales', Decimal('48000'))]

### Running Total (Cumulative Sum)

### Example 1: Running salary total (overall)

In [37]:
%%sql
SELECT name,salary,department,
SUM(salary)OVER(ORDER BY salary )AS Runing_total
from employees;

 * mysql+pymysql://root:***@localhost/customers
8 rows affected.

[('Neha', 45000, 'HR', Decimal('45000')),
 ('Rohit', 48000, 'Sales', Decimal('93000')),
 ('Priya', 50000, 'Finance', Decimal('143000')),
 ('Anita', 55000, 'Marketing', Decimal('198000')),
 ('Amit', 60000, 'IT', Decimal('258000')),
 ('Vikram', 65000, 'Finance', Decimal('323000')),
 ('Suresh', 75000, 'IT', Decimal('398000')),
 ('Rahul', 85000, 'IT', Decimal('483000'))]

### Example 2: Running total within department

In [39]:
%%sql
SELECT name,salary,department,
SUM(salary)OVER(PARTITION BY department ORDER BY salary  )AS Runing_total
from employees;

 * mysql+pymysql://root:***@localhost/customers
8 rows affected.

[('Priya', 50000, 'Finance', Decimal('50000')),
 ('Vikram', 65000, 'Finance', Decimal('115000')),
 ('Neha', 45000, 'HR', Decimal('45000')),
 ('Amit', 60000, 'IT', Decimal('60000')),
 ('Suresh', 75000, 'IT', Decimal('135000')),
 ('Rahul', 85000, 'IT', Decimal('220000')),
 ('Anita', 55000, 'Marketing', Decimal('55000')),
 ('Rohit', 48000, 'Sales', Decimal('48000'))]

### LAG() and LEAD()

Used to compare previous or next rows.

### Example 1: Previous employee salary

In [40]:
%%sql
SELECT name,salary, 
LAG(salary)OVER(ORDER BY salary)as previous_salary
from employees

 * mysql+pymysql://root:***@localhost/customers
8 rows affected.

[('Neha', 45000, None),
 ('Rohit', 48000, 45000),
 ('Priya', 50000, 48000),
 ('Anita', 55000, 50000),
 ('Amit', 60000, 55000),
 ('Vikram', 65000, 60000),
 ('Suresh', 75000, 65000),
 ('Rahul', 85000, 75000)]

### Example 2: Salary difference

In [42]:
%%sql
SELECT name,salary, 
salary-LAG(salary)OVER(ORDER BY salary)as salary_diff
from employees

 * mysql+pymysql://root:***@localhost/customers
8 rows affected.

[('Neha', 45000, None),
 ('Rohit', 48000, 3000),
 ('Priya', 50000, 2000),
 ('Anita', 55000, 5000),
 ('Amit', 60000, 5000),
 ('Vikram', 65000, 5000),
 ('Suresh', 75000, 10000),
 ('Rahul', 85000, 10000)]

### Example 3: Next salary using LEAD()

In [43]:
%%sql
SELECT name,salary, 
LEAD(salary)OVER(ORDER BY salary)as next_salary
from employees

 * mysql+pymysql://root:***@localhost/customers
8 rows affected.

[('Neha', 45000, 48000),
 ('Rohit', 48000, 50000),
 ('Priya', 50000, 55000),
 ('Anita', 55000, 60000),
 ('Amit', 60000, 65000),
 ('Vikram', 65000, 75000),
 ('Suresh', 75000, 85000),
 ('Rahul', 85000, None)]

### Advanced query

### Find 2nd Highest Salary per Department

In [48]:
%%sql
WITH ranked_data AS (
    SELECT name,
           department,
           salary,
           DENSE_RANK() OVER (
               PARTITION BY department
               ORDER BY salary DESC
           ) AS rank_num
    FROM employees
)
SELECT *
FROM ranked_data
WHERE rank_num = 2;

 * mysql+pymysql://root:***@localhost/customers
2 rows affected.

[('Priya', 'Finance', 50000, 2), ('Suresh', 'IT', 75000, 2)]

### Example 3: Global Salary Ranking with Tie Handling

In [49]:
%%sql
SELECT name,
       salary,
       RANK() OVER (ORDER BY salary DESC) AS rank_position
FROM employees;

 * mysql+pymysql://root:***@localhost/customers
8 rows affected.

[('Rahul', 85000, 1),
 ('Suresh', 75000, 2),
 ('Vikram', 65000, 3),
 ('Amit', 60000, 4),
 ('Anita', 55000, 5),
 ('Priya', 50000, 6),
 ('Rohit', 48000, 7),
 ('Neha', 45000, 8)]